## How do I use string methods in pandas?

In [9]:
import pandas as pd

In [10]:
#create dataset
orders_path = 'http://bit.ly/chiporders'
orders = pd.read_table(orders_path)

In [6]:
orders.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

In [7]:
#use str.upper to uppercase all values in col item_name
orders.item_name.str.upper()

0                CHIPS AND FRESH TOMATO SALSA
1                                        IZZE
2                            NANTUCKET NECTAR
3       CHIPS AND TOMATILLO-GREEN CHILI SALSA
4                                CHICKEN BOWL
                        ...
4617                            STEAK BURRITO
4618                            STEAK BURRITO
4619                       CHICKEN SALAD BOWL
4620                       CHICKEN SALAD BOWL
4621                       CHICKEN SALAD BOWL
Name: item_name, Length: 4622, dtype: object

In [11]:
#IMPORTANT: PANDAS
#str.contains #str #contain #select #prepare #pandas

#show all rows with "Chicken" in col "item_name"
orders[orders.item_name.str.contains('Chicken')].head(2)

,order_id,quantity,item_name,choice_description,item_price
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98

In [12]:
#IMPORTANT: PANDAS
#str.replace #str #replace #select #prepare #pandas

#replace all "[" or "]" in col choice_description
orders.choice_description.str.replace('[','').str.replace(']','').head(3)

0           NaN
1    Clementine
2         Apple
Name: choice_description, dtype: object

### How to split a string into multiple cols?

In [11]:
#create dataframe
df = pd.DataFrame({'name':['John Arthur Doe', 'Jane Ann Smith'],'location': ['Los Angeles, CA', 'Washington, DC']})
df

              name         location
0  John Arthur Doe  Los Angeles, CA
1   Jane Ann Smith   Washington, DC

In [19]:
#IMPORTANT: PANDAS
#str.split #str #split #select #prepare #pandas

#divide name into two cols
df['first name'] = df.name.str.split(' ', expand=True)[0]
df['city'] = df.location.str.split(', ', expand=True)[0]
df

              name         location first name         city
0  John Arthur Doe  Los Angeles, CA       John  Los Angeles
1   Jane Ann Smith   Washington, DC       Jane   Washington